[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/N1tfFnj/To-Kill-a-Mockingbird-first-edition-cover.jpg",
    "review": "To Kill a Mockingbird is a novel by the American author Harper Lee. It was published in June 1960 and became instantly successful. In the United States, it is widely read in high schools and middle schools. To Kill a Mockingbird has become a classic of modern American literature; a year after its release, it won the Pulitzer Prize. The plot and characters are loosely based on Lee's observations of her family, her neighbors and an event that occurred near her hometown of Monroeville, Alabama, in 1936, when she was ten.",
    "totalPages": 281,
    "rating": 4.5,
    "category": "Advanture",
    "tags": ["Classic", "Social Issues"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/v4zWNLN/1984.jpg",
    "review": "1984 is a dystopian novel that was written by George Orwell and published in 1949. It tells the story of Winston Smith, a citizen of the miserable society of Oceania, who is trying to rebel against the Party and its omnipresent symbol, Big Brother. The primary theme of 1984 by George Orwell is to warn readers of the dangers of totalitarianism. The central focus of the book is to convey the extreme level of control and power possible under a truly totalitarian regime. It explores how such a governmental system would impact society and the people who live in it.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/5x9xcj5/The-Great-Gatsby-Cover-1925-Retouched.jpg",
    "review": "The Great Gatsby, novel by American author F. Scott Fitzgerald, published in 1925. It tells the story of Jay Gatsby, a self-made millionaire, and his pursuit of Daisy Buchanan, a wealthy young woman whom he loved in his youth. Set in 1920s New York, the book is narrated by Nick Carraway. The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The Great Gatsby is a story about the impossibility of recapturing the past and also the difficulty of altering one's future.",
    "totalPages": 218,
    "rating": 4.3,
    "category": "Tragedy",
    "tags": ["Romance", "Historical Fiction"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 4,
    "bookName": "Harry Potter",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/NrJMs6y/Harry-Potter.jpg",
    "review": "Harry Potter and the Philosopher's Stone is a fantasy novel written by British author J. K. Rowling. The first novel in the Harry Potter series and Rowling's debut novel, it follows Harry Potter, a young wizard who discovers his magical heritage on his eleventh birthday, when he receives a letter of acceptance to Hogwarts School of Witchcraft and Wizardry. Harry makes close friends and a few enemies during his first year at the school and with the help of his friends, Ron Weasley and Hermione Granger, he faces an attempted comeback by the dark wizard Lord Voldemort, who killed Harry's parents, but failed to kill Harry when he was just 15 months old.",
    "totalPages": 223,
    "rating": 4.7,
    "category": "Fantasy Fiction",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/VTPWVj5/The-catcher-in-the-rye.jpg",
    "review": "The Catcher in the Rye is the story of Holden Caulfield, a teenage boy who has been expelled from his prep school and is wandering through New York City over a few days, struggling to come to terms with the complexities of growing up and the seeming phoniness of the adult world. Factors contributing to the novel's mystique and impact include its portrayal of protagonist Holden Caulfield; its tone of sincerity; its themes of familial neglect. tension between teens and society, and rebellion",
    "totalPages": 277,
    "rating": 4.4,
    "category": "Novel",
    "tags": ["Coming-of-Age", "Literary Fiction"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/DL2j2Sx/Pride-and-prejudice.jpg",
    "review": "Pride and Prejudice follows the turbulent relationship between Elizabeth Bennet, the daughter of a country gentleman, and Fitzwilliam Darcy, a rich aristocratic landowner. They must overcome the titular sins of pride and prejudice in order to fall in love and marry. Pride and Prejudice is a classic love story because it set the pattern for a modern popular love story, the story in which an independent-minded and fascinating woman is loved by a remote, powerful man.",
    "totalPages": 279,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Romance", "Classic"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 7,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/rdzM3zh/hobbit-cover-670x1024.jpg",
    "review": "The Hobbit, or There and Back Again is a children's fantasy novel by the English author J. R. R. Tolkien. It was published in 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book is recognized as a classic in children's literature and is one of the best-selling books of all time, with over 100 million copies sold.The Hobbit is set in Middle-earth and follows home-loving Bilbo Baggins, the hobbit of the title.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "High Fantasy",
    "tags": ["Adventure", "Middle-earth"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 8,
    "bookName": "Moby-Dick",
    "author": "Herman Melville",
    "image": "https://i.ibb.co/HTLPMH4/Moby-Dick.jpg",
    "review": "Moby-Dick; or, The Whale is an 1851 novel by American writer Herman Melville. The book is the sailor Ishmael's narrative of the maniacal quest of Ahab, captain of the whaling ship Pequod, for vengeance against Moby Dick, the giant white sperm whale that bit off his leg on the ship's previous voyage. A contribution to the literature of the American Renaissance, Moby-Dick was published to mixed reviews, was a commercial failure, and was out of print at the time of the author's death in 1891.",
    "totalPages": 585,
    "rating": 4.3,
    "category": "Advanture",
    "tags": ["Adventure", "Classic"],
    "publisher": "Richard Bentley",
    "yearOfPublishing": 1851
  },
  {
    "bookId": 9,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/6gq0dRX/The-lord-of-the-rings.jpg",
    "review": "The work is divided internally into six books, two per volume, with several appendices of background material. These three volumes were later published as a boxed set, and even finally as a single volume, following the author's original intent. With its complex world-building, intricate plot, and numerous characters, the novel can be overwhelming at first. And yes, it is technically one novel, split into three parts. It was published in three volumes originally because there were paper shortages as a result of World War II.",
    "totalPages": 1216,
    "rating": 4.8,
    "category": "Adventure",
    "tags": ["Epic", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 10,
    "bookName": "Frankenstein",
    "author": "Mary Shelley",
    "image": "https://i.ibb.co/BTHg83F/Frankenstein.jpg",
    "review": "Frankenstein; or, The Modern Prometheus is an 1818 novel written by English author Mary Shelley. Frankenstein tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment. Shelley's novel, Frankenstein: or, the Modern Prometheus (1818), is a combination of Gothic horror story and science fiction. The book tells the story of Victor Frankenstein, a Swiss student of natural science who creates an artificial man from pieces of corpses and brings his creature to life. ",
    "totalPages": 280,
    "rating": 4.2,
    "category": "Horror",
    "tags": ["Gothic", "Science Fiction"],
    "publisher": "Lackington, Hughes, Harding, Mavor & Jones",
    "yearOfPublishing": 1818
  },
  {
    "bookId": 11,
    "bookName": "Jane Eyre",
    "author": "Charlotte Brontë",
    "image": "https://i.ibb.co/mTGZzqb/Jane-Eyre.jpg",
    "review": "The novel follows the story of Jane, a seemingly plain and simple girl as she battles through life's struggles. Jane has many obstacles in her life - her cruel and abusive Aunt Reed, the grim conditions at Lowood school, her love for Rochester and Rochester's marriage to Bertha. The novel contains elements of social criticism, with a strong sense of Christian morality at its core, and is considered by many to be ahead of its time because of Jane's individualistic character and how the novel approaches the topics of class, sexuality, religion, and feminism.",
    "totalPages": 532,
    "rating": 4.4,
    "category": "Novel",
    "tags": ["Romance", "Gothic"],
    "publisher": "Smith, Elder & Co.",
    "yearOfPublishing": 1847
  },
  {
    "bookId": 12,
    "bookName": "The Picture of Dorian Gray",
    "author": "Oscar Wilde",
    "image": "https://i.ibb.co/LrFy3LY/the-picture-of-dorian-gray-a-to-z-classics.jpg",
    "review": "Oscar Wilde's only novel is the dreamlike story of a young man who sells his soul for eternal youth and beauty. In this celebrated work Wilde forged a devastating portrait of the effects of evil and debauchery on a young aesthete in late-19th-century England. Why is The Picture of Dorian Gray a banned book?Banned and Challenged Mystery Books to Read Now Oscar Wilde's The Picture of Dorian Gray The state of his soul is only revealed in a painted portrait of Gray. This title has faced numerous challenges since its publication in 1890, being denounced for “indecent content.” The novel has only earned its place in the literary canon over time.",
    "totalPages": 254,
    "rating": 4.3,
    "category": "Philosophical",
    "tags": ["Gothic", "Philosophical"],
    "publisher": "Ward, Lock & Co.",
    "yearOfPublishing": 1890
  },
  {
    "bookId": 13,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/CH72v04/The-alchemist.jpg",
    "review": "The Alchemist (1988) follows the story of a young Andalusian shepherd, who travels to the pyramids of Egypt to find a treasure he has recurrently dreamed about. On his journey, he has to overcome multiple obstacles through which he learns valuable life lessons. The Alchemist is famous because it is a simple story that teaches important life lessons. The novel centers around the idea of a Personal Legend, which all readers can relate to and apply to their own lives. The Alchemist is remarkable for being a love story that renounces the idea that romantic love must be the central thing in your life. Each person has a destiny to pursue that exists independently of other people.",
    "totalPages": 197,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 14,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/n347Hnd/The-Da-Vinci-Code.jpg",
    "review": "The Da Vinci Code follows symbologist Robert Langdon and cryptologist Sophie Neveu after a murder in the Louvre Museum in Paris causes them to become involved in a battle between the Priory of Sion and Opus Dei over the possibility of Jesus Christ and Mary Magdalene having had a child together. Brown has fared rather well as the underdog. The book has sold over 40 million copies since 2003 in 44 languages. In my view, the commercial success of “The Da Vinci Code” owes much to the way it smuggles serious claims about history across the border into the territory of literary fiction.",
    "totalPages": 454,
    "rating": 4.1,
    "category": "Mystery",
    "tags": ["Thriller", "Mystery"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  },
  {
    "bookId": 15,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co/RNDJJ0t/The-hunger-games.jpg",
    "review": "The Hunger Games follows Katniss Everdeen as she is forced to fight in a yearly gladiatorial contest. Katniss's struggle and ultimate survival, along with Peeta Mellark's, sparks a revolution to overthrow the tyrannical Capitol. The books cleared the way for the dystopian YA tsunami, selling over 675 million copies at release [1]. The sleek cover, relatable and inspiring characters, and exhilarating plot captivated young readers.The Hunger Games franchise highlights the inhumane and terrifying nature of the titular gladiatorial competition, where innocent children are forced to fight to the death for the sick pleasure of the elite.",
    "totalPages": 374,
    "rating": 4.4,
    "category": "Young Adult",
    "tags": ["Dystopian", "Action"],
    "publisher": "Scholastic Corporation",
    "yearOfPublishing": 2008
  },
  {
    "bookId": 16,
    "bookName": "The Road",
    "author": "Cormac McCarthy",
    "image": "https://i.ibb.co/6DnSSHN/cormac-mccarthy-the-road.jpg",
    "review": "The Road is a 2006 post-apocalyptic novel by American writer Cormac McCarthy. The book details the grueling journey of a father and his young son over a period of several months across a landscape blasted by an unspecified cataclysm that has destroyed industrial civilization and almost all life. The central theme in The Road focuses on the fragility of human civilization. We carry the fire in us, a fire to love and to endure. The main theme of the novel, The Road, is the challenge of survival, while digging deeper into the theme of not only physical survival, but facing the mental challenges that come with physical survival. ",
    "totalPages": 287,
    "rating": 4.0,
    "category": "Fiction",
    "tags": ["Post-Apocalyptic", "Literary Fiction"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2006
  },
  {
    "bookId": 17,
    "bookName": "The Kite Runner",
    "author": "Khaled Hosseini",
    "image": "https://i.ibb.co/MSsBYsP/Kite-runner.jpg",
    "review": "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father's servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. Kite runner is not just a story about an Afghan refugee in America and his trips to nostalgia..it's so much more. it's a story of friendship, failures, self introspection, forgiveness and of course Love and redemption. The kite is the metaphor. It's the selfless love between Amir and Hassan.",
    "totalPages": 371,
    "rating": 4.5,
    "category": "Drama",
    "tags": ["Drama", "Historical Fiction"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2003
  },
  {
    "bookId": 18,
    "bookName": "Brave New World",
    "author": "Aldous Huxley",
    "image": "https://i.ibb.co/xqqbgBD/brave-new-world.jpg",
    "review": "Aldous Huxley's profoundly important classic of world literature, Brave New World is a searching vision of an unequal, technologically-advanced future where humans are genetically bred, socially indoctrinated, and pharmaceutically anesthetized to passively uphold an authoritarian ruling order–all at the cost of our . What is Huxley's message in Brave New World? Huxley's main message is a warning to all that advanced technology could take over and humans could lose their humanity. His novel is a reminder that it's important not to get caught up in physical pleasures and follow one's own path, even if it's away from the group.",
    "totalPages": 311,
    "rating": 4.2,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Social Commentary"],
    "publisher": "Chatto & Windus",
    "yearOfPublishing": 1932
  },
  {
    "bookId": 19,
    "bookName": "Gone with the Wind",
    "author": "Margaret Mitchell",
    "image": "https://i.ibb.co/X3SqRC5/Gone-with-the-Wind.jpg",
    "review": "Gone with the Wind offers a romanticized view of the American Civil War from the perspective of the Confederacy. It focuses on Scarlett O'Hara, the beautiful daughter of a wealthy planter, following her romantic trials during the war and into the Reconstruction period. Gone with the Wind is a novel by American writer Margaret Mitchell, first published in 1936. The story is set in Clayton County and Atlanta, both in Georgia, during the American Civil War and Reconstruction Era.",
    "totalPages": 1037,
    "rating": 4.1,
    "category": "Historical Fiction",
    "tags": ["Romance", "American Civil War"],
    "publisher": "Macmillan Publishers",
    "yearOfPublishing": 1936
  },
  {
    "bookId": 20,
    "bookName": "The Go Programming Language",
    "author": "Alan A. A. Donovan",
    "image": "https://i.ibb.co/80rhCjf/the-go.jpg",
    "review": "The Go Programming Language is the authoritative resource for any programmer who wants to learn Go. It shows how to write clear and idiomatic Go to solve real-world problems. The book does not assume prior knowledge of Go nor experience with any specific language, so you'll find it accessible whether you're most comfortable with JavaScript, Ruby, Python, Java, or C++. The book features hundreds of interesting and practical examples of well-written Go code that cover the whole language, its most important packages, and a wide range of applications. Each chapter has exercises to test your understanding and explore extensions and alternatives. ",
    "totalPages": 400,
    "rating": 4.4,
    "category": "Programming",
    "tags": ["Coming-of-Age", "Literary Fiction"],
    "publisher": "Pearson Education",
    "yearOfPublishing": 2015
  }
]
